yunwuhai/BUGU_Temp/workspace/embedded/test/Make_STM32_Test_1/Core/0_0_Trans_BUGU_HAL/sub/0_0_0_SubTrans_0_STM32F401CC/inc/0_0_0_SubTrans_0_STM32F401CC_5_FLASH.h
#ifndef __0_0_0_SUBTRANS_0_STM32F401CC_5_FLASH_H__
#define __0_0_0_SUBTRANS_0_STM32F401CC_5_FLASH_H__

#ifdef __cplusplus
extern "C" {
#endif

#include "stm32f4xx_ll_system.h"

#define Object_DataEnum_0_0_0_SubTrans_0_STM32F401CC_1_CLK_2_LL_FLASH_LATENCY_0_LL_FLASH_LATENCY_0      LL_FLASH_LATENCY_0 
#define Object_DataEnum_0_0_0_SubTrans_0_STM32F401CC_1_CLK_2_LL_FLASH_LATENCY_1_LL_FLASH_LATENCY_1      LL_FLASH_LATENCY_1 
#define Object_DataEnum_0_0_0_SubTrans_0_STM32F401CC_1_CLK_2_LL_FLASH_LATENCY_2_LL_FLASH_LATENCY_2      LL_FLASH_LATENCY_2 
#define Object_DataEnum_0_0_0_SubTrans_0_STM32F401CC_1_CLK_2_LL_FLASH_LATENCY_3_LL_FLASH_LATENCY_3      LL_FLASH_LATENCY_3 
#define Object_DataEnum_0_0_0_SubTrans_0_STM32F401CC_1_CLK_2_LL_FLASH_LATENCY_4_LL_FLASH_LATENCY_4      LL_FLASH_LATENCY_4 
#define Object_DataEnum_0_0_0_SubTrans_0_STM32F401CC_1_CLK_2_LL_FLASH_LATENCY_5_LL_FLASH_LATENCY_5      LL_FLASH_LATENCY_5 
#define Object_DataEnum_0_0_0_SubTrans_0_STM32F401CC_1_CLK_2_LL_FLASH_LATENCY_6_LL_FLASH_LATENCY_6      LL_FLASH_LATENCY_6 
#define Object_DataEnum_0_0_0_SubTrans_0_STM32F401CC_1_CLK_2_LL_FLASH_LATENCY_7_LL_FLASH_LATENCY_7      LL_FLASH_LATENCY_7 
#define Object_DataEnum_0_0_0_SubTrans_0_STM32F401CC_1_CLK_2_LL_FLASH_LATENCY_8_LL_FLASH_LATENCY_8      LL_FLASH_LATENCY_8 
#define Object_DataEnum_0_0_0_SubTrans_0_STM32F401CC_1_CLK_2_LL_FLASH_LATENCY_9_LL_FLASH_LATENCY_9      LL_FLASH_LATENCY_9 
#define Object_DataEnum_0_0_0_SubTrans_0_STM32F401CC_1_CLK_2_LL_FLASH_LATENCY_10_LL_FLASH_LATENCY_10    LL_FLASH_LATENCY_10
#define Object_DataEnum_0_0_0_SubTrans_0_STM32F401CC_1_CLK_2_LL_FLASH_LATENCY_11_LL_FLASH_LATENCY_11    LL_FLASH_LATENCY_11
#define Object_DataEnum_0_0_0_SubTrans_0_STM32F401CC_1_CLK_2_LL_FLASH_LATENCY_12_LL_FLASH_LATENCY_12    LL_FLASH_LATENCY_12
#define Object_DataEnum_0_0_0_SubTrans_0_STM32F401CC_1_CLK_2_LL_FLASH_LATENCY_13_LL_FLASH_LATENCY_13    LL_FLASH_LATENCY_13
#define Object_DataEnum_0_0_0_SubTrans_0_STM32F401CC_1_CLK_2_LL_FLASH_LATENCY_14_LL_FLASH_LATENCY_14    LL_FLASH_LATENCY_14
#define Object_DataEnum_0_0_0_SubTrans_0_STM32F401CC_1_CLK_2_LL_FLASH_LATENCY_15_LL_FLASH_LATENCY_15    LL_FLASH_LATENCY_15

#define Func_0_0_0_SubTrans_0_STM32F401CC_5_FLASH_0_LL_FLASH_SetLatency_0_Extern(IFormParam_DataEnum_0_Latency) LL_FLASH_SetLatency(IFormParam_DataEnum_0_Latency)
#define Func_0_0_0_SubTrans_0_STM32F401CC_5_FLASH_1_LL_FLASH_GetLatency_0_Extern(OFormParam_DetaEnum_0_Latency) *OFormParam_DetaEnum_0_Latency = LL_FLASH_GetLatency()

#ifdef __cplusplus
}
#endif

#endif